Repository: Lucjedi/Metroid-Prime
Catalog: Nova Pasta-level2.tmx
Source language: en_us
Languages: pt_br

source: Black Knight
pt_br: Cavaleiro Negro

source: Demon Lord
pt_br: Senhor Demônio

source: Evil Mage
pt_br: Mago Malvado

source: Gladiator
pt_br: Gladiador

source: Rogue
pt_br: Ladrão

source: Savage Ogre
pt_br: Ogro Selvagem

source: Strong Guard
pt_br: Guarda Forte
